Revit 2026 API

# UIViewZoom Method

---

Zoom the view.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Zoom(
	double zoomFactor
)
```
```vb
Public Sub Zoom (
	zoomFactor As Double
)
```
```cpp
public:
void Zoom(
	double zoomFactor
)
```
```fsharp
member Zoom :
        zoomFactor : float -> unit
```

#### Parameters

zoomFactor Double
     Factor by which to zoom in or out. Values greater than 1 zooms in, less than 1 zooms out.

| Exception | Condition |
| --- | --- |
| ArgumentException | zoomFactor is not positive. |

#### Reference

UIView Class

Autodesk.Revit.UI Namespace